Catalogs/СценарииПооперационногоПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>СценарииПооперационногоПланирования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>РабочиеЦентрыДобавить</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабочегоЦентра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РабочиеЦентрыИсключить</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабочегоЦентра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикиРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРабочегоЦентра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>График</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Календари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СценарииПооперационногоПланирования/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если НЕ РабочиеЦентрыИсключитьЗаполненыКорректно(Отказ) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КритерииОптимизации");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РабочиеЦентрыИсключитьЗаполненыКорректно(Отказ)
	
	Результат = Истина;	
	
	ТекстЗапроса = ТекстЗапросаРабочиеЦентрыИсключитьЗаполненыКорректно();
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("РабочиеЦентрыИсключить", РабочиеЦентрыИсключить.Выгрузить());
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтоги.Следующий() Цикл
		Если ВыборкаИтоги.Исключить Тогда
			
			Результат = Ложь;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для вида рабочего центра ""%1"" все рабочие центры указаны в качестве исключаемых.'"),
				ВыборкаИтоги.ВидРабочегоЦентраПредставление);
				
			СтрокаСОшибкой = РабочиеЦентрыИсключить.Найти(ВыборкаИтоги.ВидРабочегоЦентра, "ВидРабочегоЦентра");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"РабочиеЦентрыИсключить",
				СтрокаСОшибкой.НомерСтроки,
				"ВидРабочегоЦентра");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаРабочиеЦентрыИсключитьЗаполненыКорректно()
	
	Результат = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РабочиеЦентрыИсключить.ВидРабочегоЦентра,
	|	РабочиеЦентрыИсключить.РабочийЦентр
	|ПОМЕСТИТЬ РабочиеЦентрыИсключить
	|ИЗ
	|	&РабочиеЦентрыИсключить КАК РабочиеЦентрыИсключить
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочиеЦентры.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	|	РабочиеЦентры.ВидРабочегоЦентра.Представление,
	|	РабочиеЦентры.Ссылка КАК РабочийЦентр,
	|	ВЫБОР
	|		КОГДА РабочиеЦентрыИсключить.РабочийЦентр ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Исключить
	|ИЗ
	|	Справочник.РабочиеЦентры КАК РабочиеЦентры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РабочиеЦентрыИсключить КАК РабочиеЦентрыИсключить
	|		ПО РабочиеЦентры.Ссылка = РабочиеЦентрыИсключить.РабочийЦентр
	|			И РабочиеЦентры.ВидРабочегоЦентра = РабочиеЦентрыИсключить.ВидРабочегоЦентра
	|ГДЕ
	|	РабочиеЦентры.ВидРабочегоЦентра В
	|			(ВЫБРАТЬ
	|				РабочиеЦентрыИсключить.ВидРабочегоЦентра
	|			ИЗ
	|				РабочиеЦентрыИсключить)
	|ИТОГИ
	|	МИНИМУМ(Исключить)
	|ПО
	|	ВидРабочегоЦентра";
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
